#+Title: Download Organizer
#+Author: D Smith
#+Email: nalisarc@gmail.com


* Org Stuff

#+name: run-tests
#+begin_src bash :results verbatim drawer :async 
pipenv run test
#+end_src

#+RESULTS: run-tests
:results:
============================= test session starts ==============================
platform linux -- Python 3.9.5, pytest-7.1.1, pluggy-1.0.0
rootdir: /home/d/projects/folder-organizer
collected 5 items

src/main/python/testscore.py ....                                        [ 80%]
src/main/python/testscli.py .                                            [100%]

============================== 5 passed in 0.09s ===============================
:end:



#+name: run-app
#+begin_src bash :async :results verbatim drawer 
pipenv run fbs run
#+end_src

#+RESULTS: run-app
:results:
:end:

#+name: build-projectdir
#+begin_src bash :results verbatim drawer 
mkdir -p src/main/resources/base/

#+end_src

#+RESULTS: build-projectdir
:results:
:end:

